//
//  homeworkUpdates.swift
//  VKapp_GB_VasilevD
//
//  Created by Денис Васильев on 19/10/2019.
//  Copyright © 2019 Denis Vasilev. All rights reserved.
//


/*
 
 
 
 ===   pull 2 (ДЗ к 2 уроку)   ===   17.05.2020   ===
 
 1. (выполнено) Зарегистрировать приложение в ВК;
 2. (выполнено) Заменить форму входа на WKWebView для авторизации в ВК;
 3. (выполнено) Сохранить токен в синглтоне Session;
 4. (выполнено) Использовать токен в запросах к VK API;
 5. (выполнено) Реализовать запросы к VK API;
 6. (выполнено) Получение списка друзей;
 7. (выполнено) Получение фотографий человека;
 8. (выполнено) Получение групп текущего пользователя;
 9. (выполнено) Получение групп по поисковому запросу;
 10. (выполнено) Вывести данные в консоль.

 P.S.: Парсить данные не нужно, просто вывести в консоль.
 P.P.S: Использовать VKSDK нельзя, мы учимся работать с сетью, а не с фреймворком от VK.
 
 
 
 ===   pull 1 (ДЗ к 1 уроку)   ===   14.05.2020   ===
 
 1.1. (выполнено) Добавить в проект синглтон для хранения данных о текущей сессии – Session.
 1.2. (выполнено) Добавить в него свойства:
    token: String – для хранения токена в VK,
    userId: Int – для хранения идентификатора пользователя ВК.

 
 
 */
